emacs/config.org
** General Keybindings
#+begin_src emacs-lisp
  (use-package general
    :config
    (general-evil-setup)
    ;; setup 'SPC' as global leader key
    (general-create-definer gautam/leader-keys
      :states '(normal insert visual emacs)
      :keymaps 'override
      :prefix "SPC" ;; set leader
      :global-prefix "M-SPC") ;; access leader in insert mode

    (gautam/leader-keys
      "SPC" '(counsel-M-x :wk "Counsel M-x")
      "." '(find-file :wk "Find File")
      "f c" '((lambda () (interactive) (find-file "~/.config/emacs/config.org")) :wk "Edit Emacs Configuration")
      "f r" '(counsel-recentf :wk "Find Recent Files")
      "TAB TAB" '(comment-line :wk "Comment Lines"))

    (gautam/leader-keys
      "b" '(:ignore t :wk "Buffer")
      "b b" '(switch-to-buffer :wk "Switch Buffer")
      "b i" '(ibuffer :wk "Ibuffer")
      "b k" '(kill-this-buffer :wk "Kill This Buffer")
      "b n" '(next-buffer :wk "Next Buffer")
      "b p" '(previous-buffer :wk "Previous Buffer")
      "b r" '(revert-buffer :wk "Revert Buffer"))

    (gautam/leader-keys
      "e" '(:ignore t :wk "Elisp")
      "e b" '(eval-buffer :wk "Evaluate elisp in buffer")
      "e d" '(eval-defun :wk "Evaluate defun containing or after point")
      "e e" '(eval-expression :wk "Evaluate and elisp expression")
      "e h" '(counsel-esh-history :wk "Eshell History")
      "e l" '(eval-last-sexp :wk "Evaluate elisp expression before point")
      "e r" '(eval-region :wk "Evaluate elisp in region")
      "e s" '(eshell :wk "Eshell"))

    (gautam/leader-keys
      "h" '(:ignore t :wk "Help")
      "h f" '(describe-function :wk "Describe Function")
      "h v" '(describe-function :wk "Describe Variable")
      ;; Broken, doesn't work(probably(maybe?(most of the time?)))
      ;; "h r r" '((lambda () (interactive) (load-file "~/.config/emacs/init.el")) :wk "Reload Emacs Config"))
      ;; Has to reload emacs twice for no good reason
      ;; "h r r" '(reload-init-file :wk "Reload Emacs Config"))
      "h r r" '((lambda () (interactive)
                  (load-file "~/.config/emacs/init.el")
                  (ignore (elpaca-process-queues))
                  (previous-buffer))
                :wk "Reload Emacs Config"))

    (gautam/leader-keys
      "m" '(:ignore t :wk "Org")
      "m a" '(org-agenda :wk "Org agenda")
      "m e" '(org-export-dispatch :wk "Org export dispatch")
      "m i" '(org-toggle-item :wk "Org toggle item")
      "m t" '(org-todo :wk "Org todo")
      "m B" '(org-babel-tangle :wk "Org babel tangle")
      "m T" '(org-todo-list :wk "Org todo list"))

    (gautam/leader-keys
      "m b" '(:ignore t :wk "Tables")
      "m b -" '(org-table-insert-hline :wk "Insert hline in table"))

    (gautam/leader-keys
      "m d" '(:ignore t :wk "Date/deadline")
      "m d t" '(org-time-stamp :wk "Org time stamp"))

    (gautam/leader-keys
      "p" '(projectile-command-map :wk "Projectile"))

    (gautam/leader-keys
      "t" '(:ignore t :wk "Toggle")
      "t l" '(display-line-numbers-mode :wk "Toggle Line Numbers")
      "t t" '(visual-line-mode :wk "Toggle Truncated Lines")
      "t v" '(vterm-toggle :wk "Toggle Vterm")
      "t e" '(eshell-toggle :wk "Toggle Eshell")
      "t t" '(treemacs :wk "Toggle Treemacs"))

    (gautam/leader-keys
      "w" '(:ignore t :wk "Windows")
      ;; Window splits
      "w c" '(evil-window-delete :wk "Close Window")
      "w n" '(evil-window-new :wk "New Window")
      "w s" '(evil-window-split :wk "Horizontal Split Window")
      "w v" '(evil-window-vsplit :wk "Vertical Split Window")
      ;; Window motions
      "w h" '(evil-window-left :wk "Window Left")
      "w j" '(evil-window-down :wk "Window Down")
      "w k" '(evil-window-up :wk "Window Up")
      "w l" '(evil-window-right :wk "Window Right")
      "W w" '(evil-window-next :wk "Goto Next Window")
      ;; Move Windows
      "w H" '(buf-move-left :wk "Buffer Move Left")
      "w J" '(buf-move-down :wk "Buffer Move Down")
      "w K" '(buf-move-up :wk "Buffer Move Up")
      "w L" '(buf-move-right :wk "Buffer Move Right"))
  )
#+end_src
* ALL THE ICONS
This is an icon set that can be used with dashboard, dired, ibuffer and other Emacs programs.
#+begin_src emacs-lisp
  (use-package all-the-icons
    :ensure t
    :if (display-graphic-p))

  (use-package all-the-icons-dired
    :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))
#+end_src
* APP LAUNCHER
** Counsel-Linux-App
Since we have counsel installed, we can use =counsel-linux-app= to launch our Linux apps.  It list the apps by their executable command, so it's kind of tricky to use.
#+begin_src emacs-lisp
  (defun emacs-counsel-launcher ()
    "Create and select a frame called emacs-counsel-launcher which consists only of a minibuffer and has specific dimensions. Runs counsel-linux-app on that frame, which is an emacs command that prompts you to select an app and open it in a dmenu like behaviour. Delete the frame after that command has exited"
    (interactive)
    (with-selected-frame 
      (make-frame '((name . "emacs-run-launcher")
                    (minibuffer . only)
                    (fullscreen . 0) ; no fullscreen
                    (undecorated . t) ; remove title bar
                    ;;(auto-raise . t) ; focus on this frame
                    ;;(tool-bar-lines . 0)
                    ;;(menu-bar-lines . 0)
                    (internal-border-width . 10)
                    (width . 80)
                    (height . 11)))
                    (unwind-protect
                      (counsel-linux-app)
                      (delete-frame))))

#+end_src
** App-Launcher
The =app-launcher= is a better run launcher since it reads the desktop applications on your system and you can search them by their names as defined in their desktop file.  This means that sometimes you have to search for a generic term rather than the actual binary command of the program.
#+begin_src emacs-lisp
  (use-package app-launcher
    :elpaca '(app-launcher :host github :repo "SebastienWae/app-launcher"))
  ;; create a global keyboard shortcut with the following code
  ;; emacsclient -cF "((visibility . nil))" -e "(emacs-run-launcher)"

  (defun emacs-run-launcher ()
    "Create and select a frame called emacs-run-launcher which consists only of a minibuffer and has specific dimensions. Runs app-launcher-run-app on that frame, which is an emacs command that prompts you to select an app and open it in a dmenu like behaviour. Delete the frame after that command has exited"
    (interactive)
    (with-selected-frame 
      (make-frame '((name . "emacs-run-launcher")
                    (minibuffer . only)
                    (fullscreen . 0) ; no fullscreen
                    (undecorated . t) ; remove title bar
                    ;;(auto-raise . t) ; focus on this frame
                    ;;(tool-bar-lines . 0)
                    ;;(menu-bar-lines . 0)
                    (internal-border-width . 10)
                    (width . 80)
                    (height . 11)))
                    (unwind-protect
                      (app-launcher-run-app)
                      (delete-frame))))

#+end_src
